<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of Keka, builds a package, then uploads to the JSS.</string>
		<key>Identifier</key>
		<string>com.github.marcocanc.jss.Keka</string>
		<key>Input</key>
		<dict>
			<key>CATEGORY</key>
			<string>Applications</string>
			<key>GROUP_NAME</key>
			<string>%NAME%-update-smart</string>
			<key>GROUP_TEMPLATE</key>
			<string>SmartGroupTemplate.xml</string>
			<key>NAME</key>
			<string>Keka</string>
			<key>POLICY_CATEGORY</key>
			<string>Testing</string>
			<key>POLICY_TEMPLATE</key>
			<string>PolicyTemplate.xml</string>
			<key>SELF_SERVICE_DESCRIPTION</key>
			<string></string>
			<key>SELF_SERVICE_ICON</key>
			<string>Keka.png</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.smithjw.pkg.Keka</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>category</key>
					<string>%CATEGORY%</string>
					<key>groups</key>
					<array>
						<dict>
							<key>name</key>
							<string>%GROUP_NAME%</string>
							<key>smart</key>
							<true/>
							<key>template_path</key>
							<string>%GROUP_TEMPLATE%</string>
						</dict>
					</array>
					<key>version</key>
					<string>%version%</string>
					<key>policy_category</key>
					<string>%POLICY_CATEGORY%</string>
					<key>policy_template</key>
					<string>%POLICY_TEMPLATE%</string>
					<key>prod_name</key>
					<string>%NAME%</string>
					<key>self_service_description</key>
					<string>%SELF_SERVICE_DESCRIPTION%</string>
					<key>self_service_icon</key>
					<string>%SELF_SERVICE_ICON%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
			</dict>
		</array>
		<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.hansen-m.download.Keka</key>
			<dict>
				<key>git_hash</key>
				<string>1673ab44a1ee6c1650538d8088035343687b8c39</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hansen-m-recipes/Keka/Keka.download.recipe</string>
				<key>sha256_hash</key>
				<string>44b5f441e33b7e8dba04639260c4cc4c74898615ceffab005aa7193b22f60f07</string>
			</dict>
			<key>com.github.smithjw.jss.Keka</key>
			<dict>
				<key>git_hash</key>
				<string>421611f8f8978fb4a513c04e41b7956ac9192442</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/Keka/Keka.jss.recipe</string>
				<key>sha256_hash</key>
				<string>bedf3b593a58355df0c0bb3e301fa8ca5e02f21231e0e217ed7a84068618a3a1</string>
			</dict>
			<key>com.github.smithjw.pkg.Keka</key>
			<dict>
				<key>git_hash</key>
				<string>9768619950a219bdd450c4e077ef4ae186dee55a</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.smithjw-recipes/Keka/Keka.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>576dce54e14b88a982eb9c6d1b33e0905ad2d3ef11bbd8a7dd777b920aed1a56</string>
			</dict>
		</dict>
	</dict>
	</dict>
</plist>