<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Mumble, makes a pkg of it, and uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.marcocanc.jss.Mumble</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Mumble</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Open Source voice-chat software</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Mumble.png</string>
		<key>Comment</key>
		<string>Note: PlistReader without variable injection in AutoPkg requires setting "version" input key to an empty string, as below.</string>
		<key>version</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.triti.pkg.Mumble</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.triti.download.Mumble</key>
			<dict>
				<key>git_hash</key>
				<string>afede4259831e8326410b091779497643804ed97</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.triti-recipes/Mumble/Mumble.download.recipe</string>
				<key>sha256_hash</key>
				<string>082b2dc566f842ae732fd4bc54f3768c5bdde9fea27af5743785943c23d6e564</string>
			</dict>
			<key>com.github.triti.pkg.Mumble</key>
			<dict>
				<key>git_hash</key>
				<string>a15d7f5bdfa661abb7e5b430e1eb00c98b8dc93a</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.triti-recipes/Mumble/Mumble.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>5056be916d05af7e62c97c91a05fc0f3cf4911c764b16fe06f375b6d17bf83a8</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>